STMicroelectronics/STM32CubeC5/examples/hal/dma/trigger/NUCLEO-C542RC/generated/hal/mx_hal_def.h
/**
  ******************************************************************************
  * @file           : mx_hal_def.h
  * @brief          : Exporting peripherals initialization
  *                   Include entry for the target folder to the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the mx_stm32c5xx_hal_drivers_license.md file
  * in the same directory as the generated code.
  * If no mx_stm32c5xx_hal_drivers_license.md file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef MX_HAL_DEF_H
#define MX_HAL_DEF_H

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/* Includes ------------------------------------------------------------------*/
#include "mx_def.h"
#include "stm32_hal.h"
#include "mx_cortex_mpu.h"
#include "mx_cortex_nvic.h"
#include "mx_lpdma1_ch0.h"
#include "mx_lpdma1_ch1.h"
#include "mx_gpio_default.h"
#include "mx_icache.h"
#include "mx_rcc.h"

/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/

/* Exported macros -----------------------------------------------------------*/

/* ########### Aliases to initialization functions ########### */

  /* *************************************************************
    Cortex_MPU: No software label has been defined for this peripheral instance
      in the STM32CubeMX2 configuration panel.
      As a result, no aliases are generated for mx_cortex_mpu_init
    ************************************************************* */

  /* *************************************************************
    Cortex_NVIC: No software label has been defined for this peripheral instance
      in the STM32CubeMX2 configuration panel.
      As a result, no aliases are generated for mx_cortex_nvic_init
    ************************************************************* */

  /* ***********************************************************
      LPDMA1_CH0: aliases for initialization functions
    *********************************************************** */

/**
  * @brief  Initialize the mx_lpdma1_ch0 with HAL layer
  *         Name of the User label:
  *                   mx_dma_triggering_channel
  * @retval hal_dma_handle_t Pointer on the handle on the LPDMA1_CH0 instance
  */
#define mx_dma_triggering_channel_init mx_lpdma1_ch0_init

  /* ***********************************************************
      LPDMA1_CH1: aliases for initialization functions
    *********************************************************** */

/**
  * @brief  Initialize the mx_lpdma1_ch1 with HAL layer
  *         Name of the User label:
  *                   mx_dma_triggered_channel
  * @retval hal_dma_handle_t Pointer on the handle on the LPDMA1_CH1 instance
  */
#define mx_dma_triggered_channel_init mx_lpdma1_ch1_init

  /* ***********************************************************
      gpio_default: aliases for initialization functions
    *********************************************************** */

/**
  * @brief  Initialize the mx_gpio_default with HAL layer
  *         Name of the User label:
  *                   mx_gpio_status_led
  * @retval system_status_t Value based on the system_status_t
  */
#define mx_gpio_status_led_init mx_gpio_default_init

  /* *************************************************************
    ICACHE: No software label has been defined for this peripheral instance
      in the STM32CubeMX2 configuration panel.
      As a result, no aliases are generated for mx_icache_init
    ************************************************************* */

  /* *************************************************************
    RCC: No software label has been defined for this peripheral instance
      in the STM32CubeMX2 configuration panel.
      As a result, no aliases are generated for mx_rcc_init
    ************************************************************* */

/* ########################################################### */

/* ########### Aliases to De-Initialization functions ########### */

  /* *************************************************************
    Cortex_MPU: No software label has been defined for this peripheral instance
      in the STM32CubeMX2 configuration panel.
      As a result, no aliases are generated for mx_cortex_mpu_deinit
    ************************************************************* */

  /* *************************************************************
    Cortex_NVIC: No software label has been defined for this peripheral instance
      in the STM32CubeMX2 configuration panel.
      As a result, no aliases are generated for mx_cortex_nvic_deinit
    ************************************************************* */

  /* ***********************************************************
      LPDMA1_CH0: aliases for De-Initialization functions
    *********************************************************** */

/**
  * @brief  De-Initialize the mx_lpdma1_ch0 with HAL layer
  *         Name of the User label:
  *                   mx_dma_triggering_channel
  */
#define mx_dma_triggering_channel_deinit mx_lpdma1_ch0_deinit

  /* ***********************************************************
      LPDMA1_CH1: aliases for De-Initialization functions
    *********************************************************** */

/**
  * @brief  De-Initialize the mx_lpdma1_ch1 with HAL layer
  *         Name of the User label:
  *                   mx_dma_triggered_channel
  */
#define mx_dma_triggered_channel_deinit mx_lpdma1_ch1_deinit

  /* ***********************************************************
      gpio_default: aliases for De-Initialization functions
    *********************************************************** */

/**
  * @brief  De-Initialize the mx_gpio_default with HAL layer
  *         Name of the User label:
  *                   mx_gpio_status_led
  */
#define mx_gpio_status_led_deinit mx_gpio_default_deinit

  /* *************************************************************
    ICACHE: No software label has been defined for this peripheral instance
      in the STM32CubeMX2 configuration panel.
      As a result, no aliases are generated for mx_icache_deinit
    ************************************************************* */

/* ########################################################### */

/* ########### Aliases to get HAL handle functions ########### */

  /* ***********************************************************
      LPDMA1_CH0: aliases for get handle functions
    *********************************************************** *//**
  * @brief  Get the HAL handle for LPDMA1_CH0
  *         Name of the User label:
  *                   mx_dma_triggering_channel
  * @retval hal_dma_handle_t Pointer on the handle on the LPDMA1_CH0 instance
  */
#define mx_dma_triggering_channel_gethandle mx_lpdma1_ch0_gethandle

  /* ***********************************************************
      LPDMA1_CH1: aliases for get handle functions
    *********************************************************** *//**
  * @brief  Get the HAL handle for LPDMA1_CH1
  *         Name of the User label:
  *                   mx_dma_triggered_channel
  * @retval hal_dma_handle_t Pointer on the handle on the LPDMA1_CH1 instance
  */
#define mx_dma_triggered_channel_gethandle mx_lpdma1_ch1_gethandle

  /* *************************************************************
    ICACHE: No software label has been defined for this peripheral instance
      in the STM32CubeMX2 configuration panel.
      As a result, no aliases are generated for mx_icache_gethandle
    ************************************************************* */

/* ########################################################### */

/* ########### Aliases to get IRQ Handlers functions ########### */
  /* ########################################################### */

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* MX_HAL_DEF_H */
